app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
  def index
    reviews = Review.where(product_id: params[:product_id])